In [2]:
import pandas as pd
import numpy as np

In [3]:
#Creating a range of date using pandas(generating a date)

a = pd.date_range('20230727', periods=12, freq='Y')   #pd.date_range(date,periods,freq)
print(a)

DatetimeIndex(['2023-12-31', '2024-12-31', '2025-12-31', '2026-12-31',
               '2027-12-31', '2028-12-31', '2029-12-31', '2030-12-31',
               '2031-12-31', '2032-12-31', '2033-12-31', '2034-12-31'],
              dtype='datetime64[ns]', freq='A-DEC')

In [4]:
#Lets create a DataFrame and assigning date_range(a) to it

b = np.random.randn(12, 4)

df = pd.DataFrame(b, index=a, columns=['A','B','C','D'])   #You can also represent the columns as 'columns=list('ABCD')'    
print(df)
print(df.columns)

                   A         B         C         D
2023-12-31  0.257745  1.329116 -0.604536 -0.444419
2024-12-31  0.301003  0.091395  0.486265 -0.387883
2025-12-31 -0.804150 -0.653833 -0.087194  0.053014
2026-12-31 -0.033653 -0.708977  0.976674  0.769223
2027-12-31  0.092031  1.024583 -0.106667  0.379752
2028-12-31 -1.740405  0.246261 -0.196473 -0.329534
2029-12-31 -0.006534 -0.326683  0.946912  2.577222
2030-12-31  1.292778  0.491238 -0.841472 -0.048381
2031-12-31  0.589971 -0.456979 -0.122262  1.352779
2032-12-31  1.424908  0.892540  0.361869  0.183101
2033-12-31  0.187481  0.547269 -0.605285  1.657141
2034-12-31  0.987986  1.979229  0.185269 -0.340764
Index(['A', 'B', 'C', 'D'], dtype='object')

In [35]:
#To check the complete info of the DataFrame

c = df.info()

print(c)

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 12 entries, 2023-12-31 to 2034-12-31
Freq: A-DEC
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     float64
 1   B       12 non-null     float64
 2   C       12 non-null     float64
 3   D       12 non-null     float64
dtypes: float64(4)
memory usage: 480.0 bytes
None
                   A         B         C         D
2023-12-31  0.899514  0.059491  1.328749 -2.411299
2024-12-31  0.033029 -0.468038  0.014669 -0.353335
2025-12-31  0.755364  0.793184  0.099807  1.155756
2026-12-31 -1.224550 -0.460747 -1.465465 -0.551943

In [40]:
#Using the .head(n) function, this called the index of the DataFrame from the top as the numbers you give 'n' 

df.head(4)                  #you can also used alternatives df.head(n=4)

                   A         B         C         D
2023-12-31  0.899514  0.059491  1.328749 -2.411299
2024-12-31  0.033029 -0.468038  0.014669 -0.353335
2025-12-31  0.755364  0.793184  0.099807  1.155756
2026-12-31 -1.224550 -0.460747 -1.465465 -0.551943

In [49]:
#Using the .tail(n) function, this called the index of the DataFrame from the bottom as the numbers you give 'n'

df.tail(2)

                   A         B         C         D
2033-12-31 -0.797800  0.413675 -0.580502  0.192171
2034-12-31 -0.576513 -0.062757  0.458807  0.420366

In [51]:
#Using the .isnull() to find if there is a missing value

df.isnull()

                A      B      C      D
2023-12-31  False  False  False  False
2024-12-31  False  False  False  False
2025-12-31  False  False  False  False
2026-12-31  False  False  False  False
2027-12-31  False  False  False  False
2028-12-31  False  False  False  False
2029-12-31  False  False  False  False
2030-12-31  False  False  False  False
2031-12-31  False  False  False  False
2032-12-31  False  False  False  False
2033-12-31  False  False  False  False
2034-12-31  False  False  False  False

In [53]:
#To know the sum of the missing value using the .isnull().sum function

df.isnull().sum()

A    0
B    0
C    0
D    0
dtype: int64

In [70]:
e = [[18,22],[24,13],[28,6],[34,20],[36,8],[40,19],[45,9],[50,2]]

f= pd.DataFrame(a, index=[1,2,3,4,5,6,7,8], columns=['Age','Frequency'])

print(f)

   Age  Frequency
1   18         22
2   24         13
3   28          6
4   34         20
5   36          8
6   40         19
7   45          9
8   50          2

In [79]:
#Using the .dropna() function to fill in missing value(s)

df.dropna(axis=1)

                   A         B         C         D
2023-12-31  0.033353  0.815906  0.664968 -0.438662
2024-12-31 -0.737716 -0.537503 -1.117012 -0.296334
2025-12-31  0.736537  1.867591 -1.532890 -1.076876
2026-12-31  0.690551 -0.894351 -0.748408  2.512325
2027-12-31  0.234131 -0.326795 -0.051751 -0.621760
2028-12-31  1.134142  0.274306 -1.185760  0.070079
2029-12-31  0.445750  1.119629 -0.875631  0.481102
2030-12-31  0.719060 -1.541393 -1.323994  0.305910
2031-12-31  0.633697  2.158151 -0.064939 -0.314850
2032-12-31 -1.584877  1.187791 -1.707832 -0.190275
2033-12-31  1.500563  0.008222  0.076935 -0.291424
2034-12-31  0.390573  0.000161 -1.646765  0.821343

In [87]:
#counting the value of a column head using .value_counts() function

df['A'].value_counts()

-2.477999    1
-0.934212    1
 0.893462    1
 0.434573    1
 0.494885    1
 0.318059    1
-1.647709    1
-0.182303    1
-0.434271    1
-0.331855    1
-1.072986    1
 0.594096    1
Name: A, dtype: int64

In [89]:
#using the correlation method

df.corr()

          A         B         C         D
A  1.000000 -0.423710  0.418661 -0.555601
B -0.423710  1.000000 -0.475088  0.719954
C  0.418661 -0.475088  1.000000 -0.283376
D -0.555601  0.719954 -0.283376  1.000000

In [91]:
#Using the describe function .decribe()

print(df)

                   A         B         C         D
2023-12-31 -2.477999  1.027695  0.655405  1.590708
2024-12-31 -0.934212  0.063595 -0.868371  0.811361
2025-12-31  0.893462 -0.046961  0.328703 -0.214531
2026-12-31  0.434573  0.577112  0.560039  0.964605
2027-12-31  0.494885 -0.229926  0.762877 -1.272246
2028-12-31  0.318059 -0.596559  1.476020  0.083618
2029-12-31 -1.647709  0.232969 -2.070209  0.778344
2030-12-31 -0.182303  0.188759  0.551846  0.792982
2031-12-31 -0.434271 -1.330972  2.386825 -0.574254
2032-12-31 -0.331855  0.078491 -0.151813  0.941115
2033-12-31 -1.072986 -0.079874 -1.227924 -0.442247
2034-12-31  0.594096 -0.238940  0.530269 -0.413171

In [93]:
df.describe()                 #this sumarizes all numerical data

               A          B          C          D
count  12.000000  12.000000  12.000000  12.000000
mean   -0.362188  -0.029551   0.244472   0.253857
std     1.014594   0.581906   1.196510   0.843899
min    -2.477999  -1.330972  -2.070209  -1.272246
25%    -0.968905  -0.232179  -0.330952  -0.420440
50%    -0.257079   0.008317   0.541057   0.430981
75%     0.449651   0.199811   0.682273   0.843800
max     0.893462   1.027695   2.386825   1.590708

In [97]:
df.decribe(include='all')          #used to summarizes all the columns together when they are mixed
df.decribe(include=['object'])     #used to summarizes all strings data

AttributeError: 'DataFrame' object has no attribute 'decribe'

In [101]:
#slicing Data

g = df['A']           #This is used to call the column A
h = df['D']

print(g)
print(h)

2023-12-31   -2.477999
2024-12-31   -0.934212
2025-12-31    0.893462
2026-12-31    0.434573
2027-12-31    0.494885
2028-12-31    0.318059
2029-12-31   -1.647709
2030-12-31   -0.182303
2031-12-31   -0.434271
2032-12-31   -0.331855
2033-12-31   -1.072986
2034-12-31    0.594096
Freq: A-DEC, Name: A, dtype: float64
2023-12-31    1.590708
2024-12-31    0.811361
2025-12-31   -0.214531
2026-12-31    0.964605
2027-12-31   -1.272246
2028-12-31    0.083618
2029-12-31    0.778344
2030-12-31    0.792982
2031-12-31   -0.574254
2032-12-31    0.941115
2033-12-31   -0.442247
2034-12-31   -0.413171
Freq: A-DEC, Name: D, dtype: float64

In [105]:
#To call multiple columns, we used df[[..., ...]]

df[['A','D','C']]

                   A         D         C
2023-12-31 -2.477999  1.590708  0.655405
2024-12-31 -0.934212  0.811361 -0.868371
2025-12-31  0.893462 -0.214531  0.328703
2026-12-31  0.434573  0.964605  0.560039
2027-12-31  0.494885 -1.272246  0.762877
2028-12-31  0.318059  0.083618  1.476020
2029-12-31 -1.647709  0.778344 -2.070209
2030-12-31 -0.182303  0.792982  0.551846
2031-12-31 -0.434271 -0.574254  2.386825
2032-12-31 -0.331855  0.941115 -0.151813
2033-12-31 -1.072986 -0.442247 -1.227924
2034-12-31  0.594096 -0.413171  0.530269

In [116]:
#Slicing the Data

df[0:3]                          #this is for rows alone

                   A         B         C         D
2023-12-31 -2.477999  1.027695  0.655405  1.590708
2024-12-31 -0.934212  0.063595 -0.868371  0.811361
2025-12-31  0.893462 -0.046961  0.328703 -0.214531

In [8]:
#for slicing row and column.. We will use the:
#.loc[] to select columns by names
#.iloc[] to select columns by indexes

print(df)

                   A         B         C         D
2023-12-31  0.257745  1.329116 -0.604536 -0.444419
2024-12-31  0.301003  0.091395  0.486265 -0.387883
2025-12-31 -0.804150 -0.653833 -0.087194  0.053014
2026-12-31 -0.033653 -0.708977  0.976674  0.769223
2027-12-31  0.092031  1.024583 -0.106667  0.379752
2028-12-31 -1.740405  0.246261 -0.196473 -0.329534
2029-12-31 -0.006534 -0.326683  0.946912  2.577222
2030-12-31  1.292778  0.491238 -0.841472 -0.048381
2031-12-31  0.589971 -0.456979 -0.122262  1.352779
2032-12-31  1.424908  0.892540  0.361869  0.183101
2033-12-31  0.187481  0.547269 -0.605285  1.657141
2034-12-31  0.987986  1.979229  0.185269 -0.340764

In [129]:
#slicing by index

df.iloc[2,0]

0.893461583008787

In [25]:
#slicing by index

df.iloc[10,0:4]

A    0.187481
B    0.547269
C   -0.605285
D    1.657141
Name: 2033-12-31 00:00:00, dtype: float64

In [33]:
#slicing by and calling more column by index

df.iloc[0:6,0:2]

                   A         B
2023-12-31  0.257745  1.329116
2024-12-31  0.301003  0.091395
2025-12-31 -0.804150 -0.653833
2026-12-31 -0.033653 -0.708977
2027-12-31  0.092031  1.024583
2028-12-31 -1.740405  0.246261

In [57]:
#slicing by index

df.iloc[[0,1,3,4,7,8]]

                   A         B         C         D
2023-12-31  0.257745  1.329116 -0.604536 -0.444419
2024-12-31  0.301003  0.091395  0.486265 -0.387883
2026-12-31 -0.033653 -0.708977  0.976674  0.769223
2027-12-31  0.092031  1.024583 -0.106667  0.379752
2030-12-31  1.292778  0.491238 -0.841472 -0.048381
2031-12-31  0.589971 -0.456979 -0.122262  1.352779

In [39]:
#slicing by index

df.iloc[0:7:2,:3]

                   A         B         C
2023-12-31  0.257745  1.329116 -0.604536
2025-12-31 -0.804150 -0.653833 -0.087194
2027-12-31  0.092031  1.024583 -0.106667
2029-12-31 -0.006534 -0.326683  0.946912

In [9]:
#slicing by names

df.loc[:,'A']    #printing all column in section A

2023-12-31    0.257745
2024-12-31    0.301003
2025-12-31   -0.804150
2026-12-31   -0.033653
2027-12-31    0.092031
2028-12-31   -1.740405
2029-12-31   -0.006534
2030-12-31    1.292778
2031-12-31    0.589971
2032-12-31    1.424908
2033-12-31    0.187481
2034-12-31    0.987986
Freq: A-DEC, Name: A, dtype: float64

In [13]:
df.loc['20301231','A']                #This will print the A column with the row as given
                                      #or ['2030-12-31','A']

1.2927776822241153

In [98]:
#slicing by index

df.iloc[:,:-3:-1]

                   D         C
2023-12-31 -0.444419 -0.604536
2024-12-31 -0.387883  0.486265
2025-12-31  0.053014 -0.087194
2026-12-31  0.769223  0.976674
2027-12-31  0.379752 -0.106667
2028-12-31 -0.329534 -0.196473
2029-12-31  2.577222  0.946912
2030-12-31 -0.048381 -0.841472
2031-12-31  1.352779 -0.122262
2032-12-31  0.183101  0.361869
2033-12-31  1.657141 -0.605285
2034-12-31 -0.340764  0.185269

In [114]:
#slicing by index

#df.iloc[:7:2,[-1,-3]]     #or df.iloc[:7:2,-4:-2]
df.iloc[:7:2,:-4:-2 ]

                   D         B
2023-12-31 -0.444419  1.329116
2025-12-31  0.053014 -0.653833
2027-12-31  0.379752  1.024583
2029-12-31  2.577222 -0.326683

In [145]:
#slicing by index

df.iloc[::-3,-2 ::-2]

                   C         A
2034-12-31  0.185269  0.987986
2031-12-31 -0.122262  0.589971
2028-12-31 -0.196473 -1.740405
2025-12-31 -0.087194 -0.804150

In [16]:
df.loc['2034-12-31', ['A','B']]       #calling 2 and more columns by name

A    0.987986
B    1.979229
Name: 2034-12-31 00:00:00, dtype: float64

In [148]:
#Using the drop function

df.drop(columns=['A','B'])

                   C         D
2023-12-31 -0.604536 -0.444419
2024-12-31  0.486265 -0.387883
2025-12-31 -0.087194  0.053014
2026-12-31  0.976674  0.769223
2027-12-31 -0.106667  0.379752
2028-12-31 -0.196473 -0.329534
2029-12-31  0.946912  2.577222
2030-12-31 -0.841472 -0.048381
2031-12-31 -0.122262  1.352779
2032-12-31  0.361869  0.183101
2033-12-31 -0.605285  1.657141
2034-12-31  0.185269 -0.340764

In [169]:
#Concatenation in Pandas of two DataFrame

i = pd.DataFrame({'Name':['Dele','Iyin','Aminat'], 'Age':[22,33,18]})
j = pd.DataFrame({'Name':['Dele','Larry'], 'Age':[22,20]}, index=[3,4])

print(i)
print(j)

     Name  Age
0    Dele   22
1    Iyin   33
2  Aminat   18
    Name  Age
3   Dele   22
4  Larry   20

In [172]:
#To concatenate the two dataFrame i and j

i_j = pd.concat([i,j])
print(i_j)
i_j['Name']== 'Dele'    #to check if how many times Dele occur is in the dataFrame

     Name  Age
0    Dele   22
1    Iyin   33
2  Aminat   18
3    Dele   22
4   Larry   20

0     True
1    False
2    False
3     True
4    False
Name: Name, dtype: bool

In [176]:
#To print out in tabular form data(i.e stratisfied data)

i_j[i_j['Name']== 'Dele']

   Name  Age
0  Dele   22
3  Dele   22

In [180]:
#To delete the duplicate function

i_j.drop_duplicates('Name')

     Name  Age
0    Dele   22
1    Iyin   33
2  Aminat   18
4   Larry   20

In [182]:
#Using sort_values() function to sort DataFrame

i_j.sort_values('Age')

     Name  Age
2  Aminat   18
4   Larry   20
0    Dele   22
3    Dele   22
1    Iyin   33

In [185]:
#Renaming the column head

i_j.rename(columns={'Name':'Employer', 'Age':'Employer_Age'})

  Employer  Employer_Age
0     Dele            22
1     Iyin            33
2   Aminat            18
3     Dele            22
4    Larry            20

In [187]:
#Descriptive analysis

i_j.describe()

             Age
count   5.000000
mean   23.000000
std     5.830952
min    18.000000
25%    20.000000
50%    22.000000
75%    22.000000
max    33.000000

In [189]:
#To get object value

i_j.describe(include='object')

        Name
count      5
unique     4
top     Dele
freq       2

In [192]:
#To get more information including Numerical info

i_j.describe(include='all')

        Name        Age
count      5   5.000000
unique     4        NaN
top     Dele        NaN
freq       2        NaN
mean     NaN  23.000000
std      NaN   5.830952
min      NaN  18.000000
25%      NaN  20.000000
50%      NaN  22.000000
75%      NaN  22.000000
max      NaN  33.000000

In [208]:
#Others information of descriptive analysis

k = i_j.sum()                               #This calc the total sum
l = i_j['Age'].sum()                        #This gives the age sum alone
m = i_j['Age'].count()                      #This count the total data/column we have
n = i_j['Age'].median()                     #This gives the median number
o = i_j['Age'].mode()                       #Mode means highest occurence number
p = i_j['Age'].std()                        #This gives the standard deviation of age 
q = i_j['Age'].min()                        #This gives the min value of Age
r = i_j['Age'].max()                        #This gives the max value of Age

print(r)

33

In [240]:
#Merging/Joining of two DataFrame

student_details = pd.DataFrame({'s_name':['Sreenu','Vasu','Nivas','Reddy','Sai'], 'address':['Hyd','Bang','Chennai','Pune','Mumbai'], 'contact':[9292005440,9898989898,9696969696,9595959595,9292929292]}, index=[1,2,3,4,5])
course_details = pd.DataFrame({'s_name':['Sreenu','Vasu','Nivas','Reddy','Sai'], 'course':['DataScience','MachineLearning','DataAnalytics','R','Python'], 'fee':[20000,15000,10000,8000,10000]}, index=[1,2,3,4,5])

print(student_details)
print(course_details)

   s_name  address     contact
1  Sreenu      Hyd  9292005440
2    Vasu     Bang  9898989898
3   Nivas  Chennai  9696969696
4   Reddy     Pune  9595959595
5     Sai   Mumbai  9292929292
   s_name           course    fee
1  Sreenu      DataScience  20000
2    Vasu  MachineLearning  15000
3   Nivas    DataAnalytics  10000
4   Reddy                R   8000
5     Sai           Python  10000

In [241]:
#Now lets merge the two data

pd.merge(student_details,course_details, on='s_name', how='inner')

   s_name  address     contact           course    fee
0  Sreenu      Hyd  9292005440      DataScience  20000
1    Vasu     Bang  9898989898  MachineLearning  15000
2   Nivas  Chennai  9696969696    DataAnalytics  10000
3   Reddy     Pune  9595959595                R   8000
4     Sai   Mumbai  9292929292           Python  10000

In [242]:
#changing some/updating s_name to student_name, Nivas to Rama and Sai to Sita

student_details = student_details.rename(columns={'s_name':'student_name'})

print(student_details)

  student_name  address     contact
1       Sreenu      Hyd  9292005440
2         Vasu     Bang  9898989898
3        Nivas  Chennai  9696969696
4        Reddy     Pune  9595959595
5          Sai   Mumbai  9292929292

In [249]:
#to change the name of Nivas and Sai

#student_details['student_name'][3] = 'Vasu' or used the loc/iloc function
student_details.iloc[2,0] = 'Rama'
student_details.loc[5,'student_name'] = 'Sita'

student_details

  student_name  address     contact
1       Sreenu      Hyd  9292005440
2         Vasu     Bang  9898989898
3         Rama  Chennai  9696969696
4        Reddy     Pune  9595959595
5         Sita   Mumbai  9292929292

In [256]:
#Using Inner how merging type

pd.merge(student_details, course_details, left_on='student_name', right_on='s_name', how='inner')

  student_name address     contact  s_name           course    fee
0       Sreenu     Hyd  9292005440  Sreenu      DataScience  20000
1         Vasu    Bang  9898989898    Vasu  MachineLearning  15000
2        Reddy    Pune  9595959595   Reddy                R   8000

In [258]:
#Using Outer how merging type

pd.merge(student_details, course_details, left_on='student_name', right_on='s_name', how='outer')

  student_name  address       contact  s_name           course      fee
0       Sreenu      Hyd  9.292005e+09  Sreenu      DataScience  20000.0
1         Vasu     Bang  9.898990e+09    Vasu  MachineLearning  15000.0
2         Rama  Chennai  9.696970e+09     NaN              NaN      NaN
3        Reddy     Pune  9.595960e+09   Reddy                R   8000.0
4         Sita   Mumbai  9.292929e+09     NaN              NaN      NaN
5          NaN      NaN           NaN   Nivas    DataAnalytics  10000.0
6          NaN      NaN           NaN     Sai           Python  10000.0

In [260]:
#Using the left outer how merging type

pd.merge(student_details, course_details, left_on='student_name', right_on='s_name', how='left')

  student_name  address     contact  s_name           course      fee
0       Sreenu      Hyd  9292005440  Sreenu      DataScience  20000.0
1         Vasu     Bang  9898989898    Vasu  MachineLearning  15000.0
2         Rama  Chennai  9696969696     NaN              NaN      NaN
3        Reddy     Pune  9595959595   Reddy                R   8000.0
4         Sita   Mumbai  9292929292     NaN              NaN      NaN

In [262]:
#Using the right outer how merging type

pd.merge(student_details, course_details, left_on='student_name', right_on='s_name', how='right')

  student_name address       contact  s_name           course    fee
0       Sreenu     Hyd  9.292005e+09  Sreenu      DataScience  20000
1         Vasu    Bang  9.898990e+09    Vasu  MachineLearning  15000
2          NaN     NaN           NaN   Nivas    DataAnalytics  10000
3        Reddy    Pune  9.595960e+09   Reddy                R   8000
4          NaN     NaN           NaN     Sai           Python  10000

In [268]:
#Using the sort

pd.merge(student_details, course_details, left_on='student_name', right_on='s_name', how='right', sort=True)

  student_name address       contact  s_name           course    fee
0          NaN     NaN           NaN   Nivas    DataAnalytics  10000
1        Reddy    Pune  9.595960e+09   Reddy                R   8000
2          NaN     NaN           NaN     Sai           Python  10000
3       Sreenu     Hyd  9.292005e+09  Sreenu      DataScience  20000
4         Vasu    Bang  9.898990e+09    Vasu  MachineLearning  15000

In [271]:
# Working with Text Data

s = pd.Series(['Michael','DATAhill Solutions','8114682648','Hyderabad','info@datahill.in','www.datahill.in'])

print(s)

0               Michael
1    DATAhill Solutions
2            8114682648
3             Hyderabad
4      info@datahill.in
5       www.datahill.in
dtype: object

In [289]:
s.str.islower()         #To check if all the texts are lowercase

0               MICHAEL
1    DATAHILL SOLUTIONS
2            8114682648
3             HYDERABAD
4      INFO@DATAHILL.IN
5       WWW.DATAHILL.IN
dtype: object

In [290]:
s.str.isupper()         #To check if all the texts are upper

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [292]:
s.str.isnumeric()        #To know if all the text are in numbers

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [294]:
s.str.lower()            #To convert all text to lowercase

0               michael
1    datahill solutions
2            8114682648
3             hyderabad
4      info@datahill.in
5       www.datahill.in
dtype: object

In [295]:
s.str.upper()            #To convert all text to uppercase

0               MICHAEL
1    DATAHILL SOLUTIONS
2            8114682648
3             HYDERABAD
4      INFO@DATAHILL.IN
5       WWW.DATAHILL.IN
dtype: object

In [297]:
s.str.swapcase()

0               mICHAEL
1    dataHILL sOLUTIONS
2            8114682648
3             hYDERABAD
4      INFO@DATAHILL.IN
5       WWW.DATAHILL.IN
dtype: object

In [299]:
s.str.len()           #To know the length/size of each text

0     7
1    18
2    10
3     9
4    16
5    15
dtype: int64

In [304]:
s.str.cat()            #This is for concatenating text together
s.str.cat(sep=' ')     #with seperator we can give space to the text concatenated

'Michael DATAhill Solutions 8114682648 Hyderabad info@datahill.in www.datahill.in'

In [306]:
s.str.replace('@','$')     #This is used to replace text/string to another words

0               Michael
1    DATAhill Solutions
2            8114682648
3             Hyderabad
4      info$datahill.in
5       www.datahill.in
dtype: object

In [308]:
s.str.repeat(2)           #This is used to repeat the text/string twice(2)

0                          MichaelMichael
1    DATAhill SolutionsDATAhill Solutions
2                    81146826488114682648
3                      HyderabadHyderabad
4        info@datahill.ininfo@datahill.in
5          www.datahill.inwww.datahill.in
dtype: object

In [310]:
s.str.count('s')       #This is used to count s in each text

0    0
1    1
2    0
3    0
4    0
5    0
dtype: int64

In [312]:
s.str.startswith ('P')    #To know if the text starts with a word i.e letter 'P'

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [315]:
s.str.endswith('l')       #To know if the text/string end with a word, i.e 'l'

0     True
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [317]:
# Function Application in DataFrame

df

                   A         B         C         D
2023-12-31  0.257745  1.329116 -0.604536 -0.444419
2024-12-31  0.301003  0.091395  0.486265 -0.387883
2025-12-31 -0.804150 -0.653833 -0.087194  0.053014
2026-12-31 -0.033653 -0.708977  0.976674  0.769223
2027-12-31  0.092031  1.024583 -0.106667  0.379752
2028-12-31 -1.740405  0.246261 -0.196473 -0.329534
2029-12-31 -0.006534 -0.326683  0.946912  2.577222
2030-12-31  1.292778  0.491238 -0.841472 -0.048381
2031-12-31  0.589971 -0.456979 -0.122262  1.352779
2032-12-31  1.424908  0.892540  0.361869  0.183101
2033-12-31  0.187481  0.547269 -0.605285  1.657141
2034-12-31  0.987986  1.979229  0.185269 -0.340764

In [319]:
#lets use the pipe() function

def add(a,b):
    return a+b

df.pipe(add,10)

                    A          B          C          D
2023-12-31  10.257745  11.329116   9.395464   9.555581
2024-12-31  10.301003  10.091395  10.486265   9.612117
2025-12-31   9.195850   9.346167   9.912806  10.053014
2026-12-31   9.966347   9.291023  10.976674  10.769223
2027-12-31  10.092031  11.024583   9.893333  10.379752
2028-12-31   8.259595  10.246261   9.803527   9.670466
2029-12-31   9.993466   9.673317  10.946912  12.577222
2030-12-31  11.292778  10.491238   9.158528   9.951619
2031-12-31  10.589971   9.543021   9.877738  11.352779
2032-12-31  11.424908  10.892540  10.361869  10.183101
2033-12-31  10.187481  10.547269   9.394715  11.657141
2034-12-31  10.987986  11.979229  10.185269   9.659236

In [321]:
#Lets use the colomn and row wise, apply() function

df.apply(type)

A    <class 'pandas.core.series.Series'>
B    <class 'pandas.core.series.Series'>
C    <class 'pandas.core.series.Series'>
D    <class 'pandas.core.series.Series'>
dtype: object

In [333]:
df.apply(np.mean)

A    0.212430
B    0.371263
C    0.032758
D    0.451771
dtype: float64

In [328]:
df.apply(np.mean, 1)

2023-12-31    0.134476
2024-12-31    0.122695
2025-12-31   -0.373041
2026-12-31    0.250817
2027-12-31    0.347425
2028-12-31   -0.505038
2029-12-31    0.797729
2030-12-31    0.223541
2031-12-31    0.340877
2032-12-31    0.715604
2033-12-31    0.446652
2034-12-31    0.702930
Freq: A-DEC, dtype: float64

In [330]:
#using the appl aPP for your application


df.apply(type, axis=1)

2023-12-31    <class 'pandas.core.series.Series'>
2024-12-31    <class 'pandas.core.series.Series'>
2025-12-31    <class 'pandas.core.series.Series'>
2026-12-31    <class 'pandas.core.series.Series'>
2027-12-31    <class 'pandas.core.series.Series'>
2028-12-31    <class 'pandas.core.series.Series'>
2029-12-31    <class 'pandas.core.series.Series'>
2030-12-31    <class 'pandas.core.series.Series'>
2031-12-31    <class 'pandas.core.series.Series'>
2032-12-31    <class 'pandas.core.series.Series'>
2033-12-31    <class 'pandas.core.series.Series'>
2034-12-31    <class 'pandas.core.series.Series'>
Freq: A-DEC, dtype: object